<template>
    <tr>
        <td>{{ item.name }}</td>
        <td>{{ item.price }}</td>
        <td>
            <v-btn color="primary">Edit</v-btn>
            <!-- тут ты при клике на кнопочку емитим событие делете на которое подписались
            в отце и предаем обратно ид как параметр что бы он знал каво мы удаляем-->
            <v-btn color="error" :click="$emit('delete', item.id)">Delete</v-btn>
        </td>          
    </tr>
</template>

<script>
export default {
    name: 'DataRow',
    //тут мы прописывает переменные которые принимает компонент
    //вроди не обязательно указывать тип переменной и обязательна она или нет,
    //можно и перечислить в массиве. Но это я копипастил с Казано а туда копипастил
    //еще откудато))
    //вобщем прос работает по типу const "переменная" в обычном JS перезапись
    //выдаст ошибку но если как у нас обьект то мы можем сделать иземения внутри
    //обьекта и это не вызовет ошибку компилятора, но я так подозреваю что так всеже
    //делать в Ву не стоит
    props:{
        "item":{
            type: Object,
            required: true
        }
    },
    data: () => ({
            
    })
}
</script>
